/*
** Copyright (C) 2007-2017 by Carnegie Mellon University.
**
** @OPENSOURCE_LICENSE_START@
** See license information in ../../LICENSE.txt
** @OPENSOURCE_LICENSE_END@
*/

/*
**  skipfix.c
**
**    SiLK Flow Record / IPFIX translation core
**
**    Brian Trammell
**    February 2007
*/

#define LIBFLOWSOURCE_SOURCE 1
#include <silk/silk.h>

RCSIDENT("$SiLK: skipfix.c efd886457770 2017-06-21 18:43:23Z mthomas $");

#include <silk/skipfixcert.h>
#include <silk/rwrec.h>
#include <silk/skipaddr.h>
#include <silk/skipfix.h>
#include <silk/sklog.h>
#include <silk/skvector.h>
#include <silk/utils.h>

#ifdef SKIPFIX_TRACE_LEVEL
#define TRACEMSG_LEVEL 1
#endif
#define TRACEMSG(x)  TRACEMSG_TO_TRACEMSGLVL(1, x)
#include <silk/sktracemsg.h>


/* LOCAL DEFINES AND TYPEDEFS */

/* Whether to export information elements in IPFIX files we write */
#ifndef SKIPFIX_EXPORT_ELEMENTS
#define SKIPFIX_EXPORT_ELEMENTS 0
#endif

/* The IPFIX Private Enterprise Number for CERT */
#define IPFIX_CERT_PEN  6871

/* Internal Template ID for incoming IPFIX flows. */
#define SKI_FIXREC_TID        0xAFEB

/* Internal Template ID for TCP information. */
#define SKI_TCP_STML_TID        0xAFEC

/* Internal Template ID for NetFlowV9 Sampling Options Template */
#define SKI_NF9_SAMPLING_TID    0xAFED

/* Internal Template ID for Element Type Options Template */
#define SKI_ELEMENT_TYPE_TID    0xAFEE

/* Bit in Template ID that yaf sets for templates containing reverse
 * elements */

    /* SysUpTime-based fields */
    { (char*)"flowStartSysUpTime",                 4, 0 },
    { (char*)"flowEndSysUpTime",                   4, 0 },
    /* Reverse flags */
    { (char*)"reverseTcpControlBits",              1, 0 },
    { (char*)"reverseInitialTCPFlags",             1, 0 },
    { (char*)"reverseUnionTCPFlags",               1, 0 },
    /* End reason */
    { (char*)"flowEndReason",                      1, 0 },
    /* Flow attributes */
    { (char*)"flowAttributes",                     2, 0 },
    { (char*)"reverseFlowAttributes",              2, 0 },
    /* Vlan IDs */
    { (char*)"vlanId",                             2, 0 },
    { (char*)"postVlanId",                         2, 0 },
    { (char*)"reverseVlanId",                      2, 0 },
    { (char*)"reversePostVlanId",                  2, 0 },
    /* ASN */
    { (char*)"bgpSourceAsNumber",                  4, 0 },
    { (char*)"bgpDestinationAsNumber",             4, 0 },
    /* MPLS */
    { (char*)"mplsTopLabelIPv4Address",            4, 0 },
    { (char*)"mplsTopLabelStackSection",           3, 0 },
    { (char*)"mplsLabelStackSection2",             3, 0 },
    { (char*)"mplsLabelStackSection3",             3, 0 },
    { (char*)"mplsLabelStackSection4",             3, 0 },
    { (char*)"mplsLabelStackSection5",             3, 0 },
    { (char*)"mplsLabelStackSection6",             3, 0 },
    { (char*)"mplsTopLabelPrefixLength",           1, 0 },
    { (char*)"mplsTopLabelType",                   1, 0 },
    /* Firewall events */
    { (char*)"firewallEvent",                      1, 0 },
    { (char*)"NF_F_FW_EVENT",                      1, 0 },
    { (char*)"NF_F_FW_EXT_EVENT",                  2, 0 },
    /* ICMP */
    { (char*)"icmpTypeCodeIPv4",                   2, 0 },
    { (char*)"icmpTypeIPv4",                       1, 0 },
    { (char*)"icmpCodeIPv4",                       1, 0 },
    { (char*)"icmpTypeCodeIPv6",                   2, 0 },
    { (char*)"icmpTypeIPv6",                       1, 0 },
    { (char*)"icmpCodeIPv6",                       1, 0 },
    /* Collection time and Observation time */
    { (char*)"collectionTimeMilliseconds",         8, 0 },
    { (char*)"observationTimeMilliseconds",        8, 0 },
    { (char*)"observationTimeMicroseconds",        8, 0 },
    { (char*)"observationTimeNanoseconds",         8, 0 },
    { (char*)"observationTimeSeconds",             4, 0 },
    /* Flow Sampler ID (IE48, name differs between fixbuf versions) */
    { (char*)"flowSamplerID",                      2, 1 }, /* current fixbuf */
    { (char*)"samplerId",                          2, 2 }, /* future fixbuf */
    /* flow direction */
    { (char*)"flowDirection",                      1, 0 },
    /* pad record to 64-bit boundary. */
#if SKI_FIXREC_PADDING != 0
    { (char*)"paddingOctets", SKI_FIXREC_PADDING, 0 },
#endif
    { (char*)"subTemplateMultiList",               0, 0 },
    FB_IESPEC_NULL
};

/* Keep this in sync with the ski_fixrec_spec[] above */
typedef struct ski_fixrec_st {
    uint64_t        flowStartMilliseconds;          /*   0-  7 */
    uint64_t        flowEndMilliseconds;            /*   8- 15 */

    uint8_t         sourceIPv6Address[16];          /*  16- 31 */
    uint8_t         destinationIPv6Address[16];     /*  32- 47 */

    uint32_t        sourceIPv4Address;              /*  48- 51 */
    uint32_t        destinationIPv4Address;         /*  52- 55 */

    uint16_t        sourceTransportPort;            /*  56- 57 */
    uint16_t        destinationTransportPort;       /*  58- 59 */

    uint32_t        ipNextHopIPv4Address;           /*  60- 63 */
    uint8_t         ipNextHopIPv6Address[16];       /*  64- 79 */
    uint32_t        ingressInterface;               /*  80- 83 */
    uint32_t        egressInterface;                /*  84- 87 */

    uint64_t        packetDeltaCount;               /*  88- 95 */
    uint64_t        octetDeltaCount;                /*  96-103 */

    uint8_t         protocolIdentifier;             /* 104     */
    uint8_t         silkFlowType;                   /* 105     */
    uint16_t        silkFlowSensor;                 /* 106-107 */

    uint8_t         tcpControlBits;                 /* 108     */
    uint8_t         initialTCPFlags;                /* 109     */
    uint8_t         unionTCPFlags;                  /* 110     */
    uint8_t         silkTCPState;                   /* 111     */
    uint16_t        silkAppLabel;                   /* 112-113 */

    /* MAC Addresses */
    uint8_t         sourceMacAddress[6];            /* 114-119 */
    uint8_t         destinationMacAddress[6];       /* 120-125 */

    /* TOS */
    uint8_t         ipClassOfService;               /* 126     */
    uint8_t         reverseIpClassOfService;        /* 127     */

    uint64_t        packetTotalCount;               /* 128-135 */
    uint64_t        octetTotalCount;                /* 136-143 */
    uint64_t        initiatorPackets;               /* 144-151 */
    uint64_t        initiatorOctets;                /* 152-159 */

    uint64_t        reversePacketDeltaCount;        /* 160-167 */
    uint64_t        reverseOctetDeltaCount;         /* 168-175 */
    uint64_t        reversePacketTotalCount;        /* 176-183 */
    uint64_t        reverseOctetTotalCount;         /* 184-191 */
    uint64_t        responderPackets;               /* 192-199 */
    uint64_t        responderOctets;                /* 200-207 */

    /* Time can be represented in many different formats: */

    /* start time as NTP microseconds (RFC1305); may either have end
     * Time in same format or as an flowDurationMicroseconds value. */
    uint64_t        flowStartMicroseconds;          /* 208-215 */
    uint64_t        flowEndMicroseconds;            /* 216-223 */

    /* start time as NTP nanoseconds (RFC1305) */
    uint64_t        flowStartNanoseconds;           /* 224-231 */
    uint64_t        flowEndNanoseconds;             /* 232-239 */

    /* SysUpTime: used for flow{Start,End}SysUpTime calculations.
     * Needed to support Netflow v9 in particular. */
    uint64_t        systemInitTimeMilliseconds;     /* 240-247 */

    /* start time and end times as seconds since UNIX epoch. no
     * flowDuration field */
    uint32_t        flowStartSeconds;               /* 248-251 */
    uint32_t        flowEndSeconds;                 /* 252-255 */

    /* elapsed time as either microsec or millisec.  used when the
     * flowEnd time is not given. */
    uint32_t        flowDurationMicroseconds;       /* 256-259 */
    uint32_t        flowDurationMilliseconds;       /* 260-263 */

    /* start time as delta (negative microsec offsets) from the export
     * time; may either have end time in same format or a
     * flowDurationMicroseconds value */
    uint32_t        flowStartDeltaMicroseconds;     /* 264-267 */
    uint32_t        flowEndDeltaMicroseconds;       /* 268-271 */

    /* start time of reverse flow, as millisec offset from start time
     * of forward flow */
    uint32_t        reverseFlowDeltaMilliseconds;   /* 272-275 */

    /* Start and end time as delta from the system init time.  Needed
     * to support Netflow v9. */
    uint32_t        flowStartSysUpTime;             /* 276-279 */
    uint32_t        flowEndSysUpTime;               /* 280-283 */

    /* Flags for the reverse flow: */
    uint8_t         reverseTcpControlBits;          /* 284     */
    uint8_t         reverseInitialTCPFlags;         /* 285     */
    uint8_t         reverseUnionTCPFlags;           /* 286     */

    uint8_t         flowEndReason;                  /* 287     */

    /* Flow attribute flags */
    uint16_t        flowAttributes;                 /* 288-289 */
    uint16_t        reverseFlowAttributes;          /* 290-291 */

    /* vlan IDs */
    uint16_t        vlanId;                         /* 292-293 */
    uint16_t        postVlanId;                     /* 294-295 */
    uint16_t        reverseVlanId;                  /* 296-297 */
    uint16_t        reversePostVlanId;              /* 298-299 */

    /* ASN */
    uint32_t        bgpSourceAsNumber;              /* 300-303 */
    uint32_t        bgpDestinationAsNumber;         /* 304-307 */

    /* MPLS */
    uint32_t        mplsTopLabelIPv4Address;        /* 308-311 */
    uint8_t         mplsLabels[18];                 /* 312-329 */
    uint8_t         mplsTopLabelPrefixLength;       /* 330     */
    uint8_t         mplsTopLabelType;               /* 331     */

    /* Firewall events */
    uint8_t         firewallEvent;                  /* 332     */
    uint8_t         NF_F_FW_EVENT;                  /* 333     */
    uint16_t        NF_F_FW_EXT_EVENT;              /* 334-335 */

    /* ICMP */
    uint16_t        icmpTypeCodeIPv4;               /* 336-337 */
    uint8_t         icmpTypeIPv4;                   /* 338     */
    uint8_t         icmpCodeIPv4;                   /* 339     */
    uint16_t        icmpTypeCodeIPv6;               /* 340-341 */
    uint8_t         icmpTypeIPv6;                   /* 342     */
    uint8_t         icmpCodeIPv6;                   /* 343     */

    /* Collection time and Observation time */
    uint64_t        collectionTimeMilliseconds;     /* 344-351 */
    uint64_t        observationTimeMilliseconds;    /* 352-359 */
    uint64_t        observationTimeMicroseconds;    /* 360-367 */
    uint64_t        observationTimeNanoseconds;     /* 368-375 */
    uint32_t        observationTimeSeconds;         /* 376-379 */

    /* Flow Sampler ID */
    uint16_t        samplerId;                      /* 380-381 */

    /* Flow Direction */
    uint8_t         flowDirection;                  /* 382 */

    /* padding */
#if SKI_FIXREC_PADDING != 0
    uint8_t         pad[SKI_FIXREC_PADDING];      /* 383 */
#endif

    /* TCP flags from yaf (when it is run without --silk) */
    fbSubTemplateMultiList_t stml;

} ski_fixrec_t;

/* Support for reading TCP flags from an IPFIX subTemplateMultiList as
 * exported by YAF.  This has Template ID SKI_TCP_STML_TID.
 *
 * Keep this in sync with the ski_tcp_stml_t defined below. */
static fbInfoElementSpec_t ski_tcp_stml_spec[] = {
    { (char*)"initialTCPFlags",                    1, 0 },
    { (char*)"unionTCPFlags",                      1, 0 },
    { (char*)"reverseInitialTCPFlags",             1, 0 },
    { (char*)"reverseUnionTCPFlags",               1, 0 },
    FB_IESPEC_NULL
};

/* Keep in sync with the ski_tcp_stml_spec[] defined above. */
typedef struct ski_tcp_stml_st {
    uint8_t         initialTCPFlags;
    uint8_t         unionTCPFlags;
    uint8_t         reverseInitialTCPFlags;
    uint8_t         reverseUnionTCPFlags;
} ski_tcp_stml_t;


/*
